Revit 2027 API
SharedParameterElement.GuidValue Property
 The Guid that identifies this shared parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GuidValue { get; }
Public ReadOnly Property GuidValue As Guid
	Get
public:
property Guid GuidValue {
	Guid get ();
}
member GuidValue : Guid with get
Property Value
Guid
See Also
Reference
SharedParameterElement Class
Autodesk.Revit.DB Namespace